<?php
if (!function_exists('create_slug')){
    function create_slug($string){
        $search = array(
            '#(à|á|ả|ã|ạ|ă|ằ|ắ|ẳ|ẵ|ặ|â|ầ|ấ|ẩ|ẫ|ậ)#',
            '#(è|é|ẻ|ẽ|ẹ|ê|ề|ế|ể|ễ|ệ)#',
            '#(ì|í|ỉ|ĩ|ị)#',
            '#(ò|ó|ỏ|õ|ọ|ô|ồ|ố|ổ|ỗ|ộ|ơ|ờ|ớ|ở|ỡ|ợ)#',
            '#(u|ù|ú|ủ|ũ|ụ|ư|ừ|ứ|ử|ữ|ự)#',
            "#(y|ỳ|ý|ỷ|ỹ|ỵ)#",
            "#(đ)#",
            '#(À|Á|Ả|Ã|Ạ|Ă|Ằ|Ắ|Ẳ|Ẵ|Ặ|Â|Ầ|Ấ|Ẩ|Ẫ|Ậ)#',
            '#(È|É|Ẻ|Ẽ|Ẹ|Ê|Ề|Ế|Ể|Ễ|Ệ)#',
            '#(Ì|Í|Ỉ|Ĩ|Ị)#',
            '#(Ò|Ó|Ỏ|Õ|Ọ|Ô|Ồ|Ố|Ổ|Ỗ|Ộ|Ơ|Ờ|Ớ|Ở|Ỡ|Ợ)#',
            '#(Ù|Ú|Ủ|Ũ|Ụ|Ư|Ừ|Ứ|Ử|Ữ|Ự)#',
            "#(Ỳ|Ý|Ỷ|Ỹ|Ỵ)#",
            "#(Đ)#",
            "/[^a-zA-Z0-9\-\_]/",
        );

        $replace = array(
            'a',
            'e',
            'i',
            'o',
            'u',
            'y',
            'd',
            'A',
            'E',
            'I',
            'O',
            'U',
            'Y',
            'D',
            '-',
        );
        $string = preg_replace($search,$replace,$string);
        $string = preg_replace('/(-)+/','-', $string);
        $string = strtolower($string);
        return $string;
    }
}
?>